#Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой,
# а некоторые – гербом. Определите минимальное число монеток,
# которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и
# той же стороной.
# Выведите минимальное количество монет, которые нужно перевернуть

N = int(input('Введите количество монет: '))
orel = 0
reshka = 0
i = 0
while i < N:
    x = int(input('Орел(1) или решка(0)? '))
    if x == 1:
        orel += 1
        i+=1
    else:
        reshka += 1
        i+=1
if orel < reshka:
    print(f'Переверните {orel} монет с орла на решку, их меньше всего')
elif orel == reshka:
    print(f'Количество орлов и решек одинаково, по {orel} штук')
else:
    print((f'Переверните {reshka} монет с решки на орла, их меньше всего'))


#Задача 12: Петя и Катя – брат и сестра.
# Петя – студент, а Катя – школьница.
# Петя помогает Кате по математике.
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать.
# Для этого Петя делает две подсказки.
# Он называет сумму этих чисел S и их произведение P.
# Помогите Кате отгадать задуманные Петей числа.

s = abs(int(input('Введите сумму: ')))
p = abs(int(input('Введите произведение: ')))
for x in range(s):
    for y in range(p):
        if s == x + y and p == x * y:
            print(f'первое число ="{x}", второе число ="{y}"')
            exit()

#Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.
n = int(input('Введи число N:'))
i = 0
while 2**i <= n:
    print(f' 2 в степени {i} равна {2 ** i}')
    i += 1